# Grouping and Aggregation

Grouping and aggregation are fundamental techniques that enable data analysts to efficiently summarise and derive insights from complex datasets based on specified attributes.

Here we cover essential operations such as grouping data based on specific criteria, calculating summary statistics within each group, and applying various aggregation functions to derive meaningful insights from the dataset.

**Sample data**:

In [1]:
import pandas as pd

In [2]:
data = {
    'employee_id': [2, 3, 4, 7, 8, 9],
    'name': ['Sal', 'Yang', 'Khaya', 'Lin', 'Eve', 'Mike'],
    'department': ['Sales', 'Marketing', 'Engineering', 'Sales', 'Engineering', 'Sales'],
    'salary': [60000, 75000, 80000, 62000, 90000, 70000]
}
df = pd.DataFrame(data)

## Group by a column

This example demonstrates how to group the data by the `department` column and then display the groups.

In [3]:
grouped = df.groupby('department')

# Display the grouped data
for name, group in grouped:
    print(name)
    print(group)

Engineering
   employee_id   name   department  salary
2            4  Khaya  Engineering   80000
4            8    Eve  Engineering   90000
Marketing
   employee_id  name department  salary
1            3  Yang  Marketing   75000
Sales
   employee_id  name department  salary
0            2   Sal      Sales   60000
3            7   Lin      Sales   62000
5            9  Mike      Sales   70000

## Calculation based on groups

Calculating the mean salary for each department:

In [4]:
mean_salary = df.groupby('department')['salary'].mean()
mean_salary

department
Engineering    85000.0
Marketing      75000.0
Sales          64000.0
Name: salary, dtype: float64

Counting the number of employees in each department:

In [5]:
employee_count = df.groupby('department').size()
employee_count

department
Engineering    2
Marketing      1
Sales          3
dtype: int64

_Note that this could have also been done with the value counts method_.

In [6]:
df['department'].value_counts()

department
Sales          3
Engineering    2
Marketing      1
Name: count, dtype: int64

Finding the highest salary in each department:

In [7]:
max_salary = df.groupby('department')['salary'].max()
max_salary

department
Engineering    90000
Marketing      75000
Sales          70000
Name: salary, dtype: int64

## Applying multiple aggregation functions at once

Sometimes we want to calculate multiple metrics for each grouping. 

Here we calculate the mean, minimum, and maximum salary for each department. The resulting DataFrame shows these aggregated values for each department, providing a concise summary of the salary statistics within each group.

In [8]:
agg_result = df.groupby('department').agg({'salary': ['mean', 'min', 'max']})
agg_result

              salary
                mean    min    max
department
Engineering  85000.0  80000  90000
Marketing    75000.0  75000  75000
Sales        64000.0  60000  70000